Revit 2026 API

# MechanicalSystemDuctNetwork Property

---

The ducts and fittings contained within the system.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementSet DuctNetwork { get; }
```
```vb
Public ReadOnly Property DuctNetwork As ElementSet
	Get
```
```cpp
public:
property ElementSet^ DuctNetwork {
	ElementSet^ get ();
}
```
```fsharp
member DuctNetwork : ElementSet with get
```

#### Property Value

ElementSet

The return value doesn't include terminals or equipments, the ducts and fittings are returned in no particular order.

#### Reference

MechanicalSystem Class

Autodesk.Revit.DB.Mechanical Namespace